Tekla Open API Reference for Tekla Structures 2025
Distance.PointToPoint Method
 Returns the distance between the given two points.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static double PointToPoint(
	Point Point1,
	Point Point2
)
Public Shared Function PointToPoint (
	Point1 As Point,
	Point2 As Point
) As Double
Parameters
Point1
Type: Tekla.Structures.Geometry3d.Point
The first point to be used.
Point2
Type: Tekla.Structures.Geometry3d.Point
The second point to be used.
Return Value
Type: Double
The distance between the given points.
See Also
Reference
Distance Class
Tekla.Structures.Geometry3d Namespace